---
sidebar: sidebar 
permalink: networking/configure_lif_service_policies.html 
keywords: create service policy, assign service policy, service policy commands, configure lif service policies, create and assign a service policy for lifs, configure lif service policies, create a service policy for lifs, network interface service show, service-policy create, assign a service policy to a lif, examples, commands for managing lif service policies 
summary: LIF에 대한 서비스 정책을 생성하고 할당합니다 
---
= LIF 서비스 정책을 구성합니다
:hardbreaks:
:allow-uri-read: 
:nofooter: 
:icons: font
:linkattrs: 
:imagesdir: ./media/


[role="lead"]
LIF 서비스 정책을 구성하여 LIF를 사용할 단일 서비스 또는 서비스 목록을 식별할 수 있습니다.



== LIF에 대한 서비스 정책을 생성합니다

LIF에 대한 서비스 정책을 생성할 수 있습니다. 하나 이상의 LIF에 서비스 정책을 할당할 수 있으므로 LIF에서 단일 서비스 또는 서비스 목록에 대한 트래픽을 전송할 수 있습니다.

'network interface service-policy create' 명령을 실행하려면 고급 권한이 필요합니다.

.이 작업에 대해
기본 제공 서비스 및 서비스 정책을 사용하여 데이터 및 시스템 SVM에서 데이터 및 관리 트래픽을 관리할 수 있습니다. 대부분의 사용 사례는 사용자 지정 서비스 정책을 만들지 않고 기본 제공 서비스 정책을 사용하여 충족됩니다.

필요한 경우 이러한 기본 제공 서비스 정책을 수정할 수 있습니다.

.단계
. 클러스터에서 사용 가능한 서비스를 봅니다.
+
....
network interface service show
....
+
서비스는 LIF에서 액세스하는 애플리케이션 및 클러스터에서 지원하는 애플리케이션을 나타냅니다. 각 서비스에는 응용 프로그램이 수신 대기 중인 0개 이상의 TCP 및 UDP 포트가 포함됩니다.

+
다음과 같은 추가 데이터 및 관리 서비스를 사용할 수 있습니다.

+
....
cluster1::> network interface service show

Service                     Protocol:Ports
-------                     --------------
cluster-core                -
data-cifs                   -
data-core                   -
data-flexcache              -
data-iscsi                  -
data-nfs                    -
intercluster-core           tcp:11104-11105
management-autosupport      -
management-bgp              tcp:179
management-core             -
management-https            tcp:443
management-ssh              tcp:22
12 entries were displayed.
....
. 클러스터에 존재하는 서비스 정책을 확인합니다.
+
....
cluster1::> network interface service-policy show

Vserver   Policy                     Service: Allowed Addresses
--------- -------------------------- ----------------------------------------
cluster1
          default-intercluster       intercluster-core: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          default-management         management-core: 0.0.0.0/0
                                     management-autosupport: 0.0.0.0/0
                                     management-ssh: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          default-route-announce     management-bgp: 0.0.0.0/0

Cluster
          default-cluster            cluster-core: 0.0.0.0/0

vs0
          default-data-blocks        data-core: 0.0.0.0/0
                                     data-iscsi: 0.0.0.0/0

          default-data-files         data-core: 0.0.0.0/0
                                     data-nfs: 0.0.0.0/0
                                     data-cifs: 0.0.0.0/0
                                     data-flexcache: 0.0.0.0/0

          default-management         data-core: 0.0.0.0/0
                                     management-ssh: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

7 entries were displayed.
....
. 서비스 정책 생성:
+
....
cluster1::> set -privilege advanced
Warning: These advanced commands are potentially dangerous; use them only when directed to do so by technical support.
Do you wish to continue? (y or n): y

cluster1::> network interface service-policy create -vserver <svm_name> -policy <service_policy_name> -services <service_name> -allowed-addresses <IP_address/mask,...>
....
+
** "service_name"은 정책에 포함되어야 하는 서비스 목록을 지정합니다.
** "ip_address/mask"는 서비스 정책의 서비스에 액세스할 수 있는 주소에 대한 서브넷 마스크 목록을 지정합니다. 기본적으로 지정된 모든 서비스는 모든 서브넷의 트래픽을 허용하는 기본 허용 주소 목록인 0.0.0.0/0으로 추가됩니다. 기본값이 아닌 허용 주소 목록이 제공되는 경우 정책을 사용하는 LIF는 지정된 마스크와 일치하지 않는 소스 주소를 가진 모든 요청을 차단하도록 구성됩니다.
+
다음 예에서는 _nfs_and_smb_services를 포함하는 SVM에 대해 _svm1_data_policy_라는 데이터 서비스 정책을 생성하는 방법을 보여 줍니다.

+
....
cluster1::> set -privilege advanced
Warning: These advanced commands are potentially dangerous; use them only when directed to do so by technical support.
Do you wish to continue? (y or n): y

cluster1::> network interface service-policy create -vserver svm1 -policy svm1_data_policy -services data-nfs,data-cifs,data-core
....
+
다음 예제에서는 인터클러스터 서비스 정책을 만드는 방법을 보여 줍니다.

+
....
cluster1::> set -privilege advanced
Warning: These advanced commands are potentially dangerous; use them only when directed to do so by technical support.
Do you wish to continue? (y or n): y

cluster1::> network interface service-policy create -vserver cluster1 -policy intercluster1 -services intercluster-core
....


. 서비스 정책이 생성되었는지 확인합니다.
+
....
cluster1::> network interface service-policy show
....
+
다음 출력에는 사용 가능한 서비스 정책이 나와 있습니다.

+
....
cluster1::> network interface service-policy show

Vserver   Policy                     Service: Allowed Addresses
--------- -------------------------- ----------------------------------------
cluster1
          default-intercluster       intercluster-core: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          intercluster1              intercluster-core: 0.0.0.0/0

          default-management         management-core: 0.0.0.0/0
                                     management-autosupport: 0.0.0.0/0
                                     management-ssh: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          default-route-announce     management-bgp: 0.0.0.0/0

Cluster
          default-cluster            cluster-core: 0.0.0.0/0

vs0
          default-data-blocks        data-core: 0.0.0.0/0
                                     data-iscsi: 0.0.0.0/0

          default-data-files         data-core: 0.0.0.0/0
                                     data-nfs: 0.0.0.0/0
                                     data-cifs: 0.0.0.0/0
                                     data-flexcache: 0.0.0.0/0

          default-management         data-core: 0.0.0.0/0
                                     management-ssh: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          svm1_data_policy           data-core: 0.0.0.0/0
                                     data-nfs: 0.0.0.0/0
                                     data-cifs: 0.0.0.0/0

9 entries were displayed.
....


.작업을 마친 후
서비스 정책을 생성할 때 또는 기존 LIF를 수정하여 LIF에 할당합니다.



== LIF에 서비스 정책을 할당합니다

LIF를 생성할 때 또는 LIF를 수정하여 서비스 정책을 LIF에 할당할 수 있습니다. 서비스 정책은 LIF에서 사용할 수 있는 서비스 목록을 정의합니다.

.이 작업에 대해
admin 및 Data SVM에서 LIF에 서비스 정책을 할당할 수 있습니다.

.단계
서비스 정책을 LIF에 할당할 시기에 따라 다음 작업 중 하나를 수행합니다.

[cols="25,75"]
|===
| 만약... | 서비스 정책 할당... 


| LIF 생성 | 네트워크 인터페이스 create-vserver svm_name -lif <lif_name> -home-node <node_name> -home-port <port_name> {(-address <ip_address> -netmask <ip_address>) -subnet-name <subnet_name>} -service-policy <service_policy_name> 


| LIF 수정 | 네트워크 인터페이스 modify -vserver <svm_name> -lif <lif_name> -service-policy <service_policy_name> 
|===
LIF에 서비스 정책을 지정할 때 LIF의 데이터 프로토콜과 역할을 지정할 필요가 없습니다. 역할 및 데이터 프로토콜을 지정하여 LIF를 생성할 수도 있습니다.


NOTE: 서비스 정책은 서비스 정책을 생성할 때 지정한 SVM에 있는 LIF에서만 사용할 수 있습니다.



=== 예

다음 예에서는 LIF의 서비스 정책을 수정하여 기본 관리 서비스 정책을 사용하는 방법을 보여 줍니다.

....
cluster1::> network interface modify -vserver cluster1 -lif lif1 -service-policy default-management
....


== LIF 서비스 정책을 관리하는 명령입니다

네트워크 인터페이스 서비스 정책 명령을 사용하여 LIF 서비스 정책을 관리합니다.

|===


| 원하는 작업 | 이 명령 사용... 


 a| 
서비스 정책 생성(고급 권한 필요)
 a| 
네트워크 인터페이스 서비스 정책 만들기



 a| 
기존 서비스 정책에 추가 서비스 항목 추가(고급 권한 필요)
 a| 
네트워크 인터페이스 서비스 정책 추가 서비스



 a| 
기존 서비스 정책 클론 생성(고급 권한 필요)
 a| 
네트워크 인터페이스 서비스 정책 클론



 a| 
기존 서비스 정책의 서비스 항목 수정(고급 권한 필요)
 a| 
네트워크 인터페이스 서비스 정책 수정 서비스



 a| 
기존 서비스 정책에서 서비스 항목 제거(고급 권한 필요)
 a| 
네트워크 인터페이스 서비스 정책 제거 서비스



 a| 
기존 서비스 정책 이름 바꾸기(고급 권한 필요)
 a| 
네트워크 인터페이스 서비스 정책 이름 바꾸기



 a| 
기존 서비스 정책 삭제(고급 권한 필요)
 a| 
네트워크 인터페이스 서비스 정책 삭제



 a| 
기본 제공 서비스 정책을 원래 상태로 복원(고급 권한 필요)
 a| 
네트워크 인터페이스 서비스 정책 복원 - 기본값



 a| 
기존 서비스 정책을 표시합니다
 a| 
네트워크 인터페이스 서비스 정책 쇼

|===